tap "opencode-ai/tap"
tap "nikitabobko/tap"
tap "hashicorp/tap"
tap "sst/tap"
brew "gettext", args: ["build-from-source"]
brew "ast-grep"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "btop"
brew "ripgrep"
brew "coreutils"
brew "curl"
brew "delve"
brew "fd"
brew "ffmpeg"
brew "imagemagick"
brew "fish"
brew "fish-lsp"
brew "fzf"
brew "pi-coding-agent"
brew "gh"
brew "ghostscript"
brew "git"
brew "jq"
brew "mas"
brew "mermaid-cli"
brew "mkcert"
brew "neovim"
brew "nginx", restart_service: :changed
brew "nss"
brew "pngpaste"
brew "shellcheck"
brew "tcl-tk"
brew "tectonic"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "tmux"
brew "hashicorp/tap/terraform"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "stow"
brew "jj"
cask "amethyst"
cask "ghostty"
cask "mitmproxy"
cask "codex"
cask "opencode-desktop"
cask "vlc"
cask "t3-code"
brew "jnsahaj/lumen/lumen"
brew "git-delta"
cask "claude"
cask "logitune"
cask "superwhisper"
