tap "opencode-ai/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "sst/tap", trusted: true
tap "jnsahaj/lumen", trusted: true
brew "ast-grep"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "btop"
brew "ripgrep"
brew "coreutils"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-debug"
brew "datadog/lapdog/lapdog"
brew "curl"
brew "delve"
brew "fd"
brew "ffmpeg"
brew "imagemagick"
brew "fish"
brew "fish-lsp"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "jq"
brew "mas"
brew "mermaid-cli"
brew "mkcert"
brew "neovim"
brew "nginx", restart_service: :changed
brew "nmap"
brew "nss"
brew "pngpaste"
brew "pyenv"
brew "shellcheck"
brew "tcl-tk"
brew "terminal-notifier"
brew "tectonic"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "tmux"
brew "hashicorp/tap/terraform"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "stow"
brew "jj"
brew "nvm"
brew "aws-sam-cli"
brew "aws-sso-util"
brew "go"
brew "pnpm"
brew "agent-browser"
brew "iputils"
brew "arp-scan"
brew "jnsahaj/lumen/lumen"
brew "git-delta"
brew "libgit2"
brew "yq"
cask "claude"
cask "chatgpt"
cask "nkzw-tech/tap/codiff"
cask "amethyst"
cask "ghostty"
cask "mitmproxy"
cask "codex"
cask "opencode-desktop"
cask "vlc"
cask "t3-code"
cask "logitune"
cask "superwhisper"


go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
