tap "nikitabobko/tap"
tap "sst/tap"
brew "ast-grep"
brew "aws-sam-cli"
brew "bash"
brew "node"
brew "bash-language-server"
brew "bat"
brew "btop"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "delve"
brew "fd"
brew "fish"
brew "fish-lsp"
brew "gemini-cli"
brew "gh"
brew "git"
brew "go"
brew "mas"
brew "mkcert"
brew "neovim"
brew "nss"
brew "nvm"
brew "openjdk"
brew "pngpaste"
brew "r"
brew "shellcheck"
brew "tcl-tk"
brew "tmux"
brew "wget"
brew "zoxide"
cask "aerospace"
cask "ghostty"
cask "mitmproxy"
cask "wireshark-app"
mas "CrystalFetch", id: 6454431289
mas "Developer", id: 640199958
mas "Grocery", id: 1195676848
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Mini Motorways", id: 1456188526
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Vimlike", id: 1584519802
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aeresov.klipper-config"
vscode "alanzhang.open-symlink-source"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "chakrounanas.turbo-console-log"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.heygithub"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "idbartosz.darkpp-italic"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ml.nc-gcode"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mxsdev.typescript-explorer"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "valiantsin.operatormonodarktheme"
vscode "xaver.clang-format"
vscode "ziyasal.vscode-open-in-github"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
